package com.hxb.demo23;

public class Test {
    static void main() {
        /**
         * 抽象类和抽象方法的注意事项：
         *  1. 抽象类不能实例化（就是不能创建对象）
         *      如果可以创建抽象类的对象的话，用对象调用一个没有方法体的抽象方法，没有任何意义
         *  2. 抽象类中不一定有抽象方法（比如父类和子类之间加一个中间层类，这个中间层类就是抽象类，并且没有抽象方法）
         *      作用：为了不让外界创建本类的对象
         *      有抽象方法的类一定是抽象类
         *  3. 抽象类中可以有构造方法
         *      作用：为了给成员变量赋值（初始化）
         *  4. 抽象类的子类
         *      要么重写抽象类中的所有抽象方法（正常使用）
         *      要么子类也声明为抽象类（这种意义不大，还要写一个孙子类继承子类，并且重写抽象方法，在外界才可以创建孙子类的对象，调用里面的方法）
         */
    }
}
