package com.hxb.demo17;

public class Test {
    static void main() {
        /**
         * 子类真正能继承父类的是什么？
         *  构造方法：不能被子类继承，可以利用super()调用
         *  成员变量：可以被子类继承，private私有也可以被继承，但是私有的无法直接调用，只能通过get和set方法调用
         *  成员方法：虚方法是通过虚方法表的形式被子类继承的
         *          final修饰的最终方法不能被继承，可以被调用
         *          static修饰的静态方法不能被继承，可以被调用
         *          private修饰的私有方法不能被继承，也不可以被调用
         *          方法重写：子类替换虚方法表里面方法的地址值
         *
         * 虚方法：就是普通的成员方法，非final、非static、非private修饰的方法
         *
         * 虚方法的继承规则：顶级父类会把本类的虚方法的内存地址汇总到虚方法表中，并把虚方法表交给子类，
         *                子类会在这张表的基础上添加自己的虚方法，当子类对象调用虚方法时，就会到本类的虚方法表中查找对应的地址，
         *                并把对应的虚方法加载到栈内存中执行；如果重写了虚方法，那么虚方法表中的地址值就会被替换为新的地址值
         *
         * final修饰的最终方法不能被继承，可以被调用
         *  编译期：一级一级往上找，遍历整个继承链，确定要调用的方法在比如A类里面，就记录该方法的地址
         *  运行期：直接运行编译时确定的方法，虽然降低了编译的速度，但是运行的速度会得到保证
         *
         * static修饰的最终方法不能被继承，可以被调用
         *  编译期：一级一级往上找，遍历整个继承链，确定要调用的方法在比如A类里面，如果是使用对象调用方法，则直接修改为类名调用方法
         *  运行期：直接运行
         */
    }
}
