package com.FileNIO.Demo08;

public class Test {
    /**
     * IO流概述
     *  I：指Input，称为输入流，负责把数据读进到内存中
     *  O：指Output，称为输出流，负责写数据出来到外部
     *
     * IO流的分类：
     *  按流的方向分类：输入流和输出流
     *  按流中数据的最小单位分类：字节流和字符流
     *      字节流：适合操作所有类型的文件，比如图片、视频、音频等（以一个一个字节为单位流入流出）
     *      字符流：只适合操作纯文本文件，比如读写txt、java文件等（以一个一个字符为单位流入流出）
     *
     * IO流总体来看就有四大流：
     *  1. 字节输入流：以内存为基准，来自磁盘文件/网络中的数据以字节的形式读入到内存中去的流
     *  2. 字节输出流：以内存为基准，将内存中的数据以字节的形式写出到磁盘文件/网络中去的流
     *  3. 字符输入流：以内存为基准，来自磁盘文件/网络中的数据以字符的形式读入到内存中去的流
     *  4. 字符输出流：以内存为基准，将内存中的数据以字符的形式写出到磁盘文件/网络中去的流
     *
     * IO流的体系：
     *  java.io包下：（都是抽象类）
     *      1. 字节输入流：InputStream -- 实现类：FileInputStream等
     *      2. 字节输出流：OutputStream -- 实现类：FileOutputStream等
     *      3. 字符输入流：Reader -- 实现类：FileReader等
     *      4. 字符输出流：Writer -- 实现类：FileWriter等
     */
}
