package com.hxb.demo21;

public class Test {
    static void main() {
        /**
         * 多态调用成员的特点：
         *  变量调用：编译看左边，运行也看左边
         *  方法调用：编译看左边，运行看右边
         *
         * 编译：在把java文件编译成class文件的时候
         *
         * 引用数据类型的类型转换：
         *  自动类型转换（从子到父）：子类对象赋值给父类类型的变量
         *  强制类型转换（从父到子）：子类 对象变量 = (子类)父类类型的变量
         *                        Person p = new Student();
         *                        Student s = (Student)p;
         *  作用：可以解决多态的弊端，可以实现调用子类独有的功能
         */

        // 利用多态方式创建对象
        Fu f = new Zi();
        /**
         * 调用成员变量：编译看左边，运行也看左边
         *  编译看左边：看父类中有没有这个变量，如果有编译成功，如果没有编译失败
         *  运行也看左边：在代码真正运行的时候，使用父类中的变量
         */
        System.out.println(f.name);

        /**
         * 调用成员方法：编译看左边，运行看右边
         *  编译看左边：看父类当中有没有这个方法，如果没有代码报错
         *  运行看右边：在代码真正运行的时候，运行的是子类里面的方法，如果子类没有重写父类里面的方法，则使用的还是父类的方法
         */
        f.show();

        // 问题一：为什么调用fuShow方法程序没有报错？因为编译看左边，编译的时候会看父类是否有这个方法，如果有编译成功，如果没有编译失败
        // 问题二：程序运行的结果是什么？因为运行看右边，会先看子类中是否有这个方法，如果有调用子类的方法，如果没有调用父类的方法
        f.fuShow();

        // 问题三：为什么调用ziShow方法程序报错？因为编译看左边，编译的时候会看父类是否有这个方法，如果没有代码报错，连运行的机会都没有
        // 多态的弊端：不能调用子类的特有方法
        // f.ziShow();

        // 解决多态的弊端
        Zi zi = (Zi) f;
        zi.ziShow();

        /**
         * 注意点： 爷爷 爸爸 儿子
         * 创建了爸爸的对象，赋值给了爷爷类型
         * 在进行强制类型转换的时候，爷爷类型只能转到爸爸类型，不能转成儿子类型
         */
        Ye y = new Fu();
        // 判断一下，y实际是否指向Fu类型的对象
        if (y instanceof Fu) {
            Fu fu = (Fu) y;
            fu.fuShow();
            fu.show();
        } else {
            System.out.println("y不是Fu类型的对象");
        }
    }
}
