package com.hxb.demo06;

public class Test {
    /**
     * java中对象的内存分配
     * 当创建对象Student stu = new Student();时，会执行以下7个步骤
     * 1. 加载class字节码文件
     * 2. 申明等号左边的局部变量：stu存的是堆中的地址
     * 3. 在堆中开辟一个空间（这个空间就是对象）
     * 4. 给对象中的属性进行默认初始化
     * 5. 给对象中的属性进行显示初始化
     * 6. 给对象中的属性利用构造方法进行初始化
     * 7. 把对象的内存地址赋值给等号左边的变量stu
     *
     * 方法出栈之后，方法里面的变量全部消失
     *
     * 如果没有任何地方使用堆里面的对象，那么对象也会从堆里面消失
     *
     * 方法区里面字节码信息一般不会消失，除非关闭虚拟机
     *
     * 把一个对象传递给方法时，传递的是对象的内存地址
     *
     * 当多个变量指向同一个对象时，只要有一个变量修改了对象中的属性，其他变量再次访问就是修改后的结果
     *
     * this的本质：代表所在方法调用者的内存地址
     */
}
