package com.hxb.demo25;

public class Test {
    static void main() {
        /**
         * 接口中成员的特点：
         *  成员变量：只能是常量。默认修饰符：public static final
         *  构造方法：没有（因为接口不能创建对象，而且接口里面所有的成员变量都是常量，已经有数据了）
         *  成员方法：只能是抽象方法。默认修饰符：public abstract
         *      JDK7以前：接口中只能定义抽象方法
         *      JDK8的新特性：接口中可以定义有方法体的方法
         *      JDK9的新特性：接口中可以定义私有方法
         *
         * 接口和类之间的关系：
         *  类和类的关系：继承关系，只能单继承，不能多继承，但是可以多层继承
         *  类和接口的关系：实现关系，可以单实现，也可以多实现，还可以在继承一个类的同时实现多个接口
         *  接口和接口的关系：继承关系，可以单继承，也可以多继承
         */
        System.out.println(Inter.A);

        A a = new A();
        a.interShow();
    }
}
