package com.collection.demo09;

public class B {
    /**
     * HashSet在JDK8以前的底层原理：
     *  1. 创建一个默认长度为16，默认加载因子为0.75的数组，数组名为table
     *      HashSet<String> hm = new HashSet<>();
     *  2. 添加数据：不是从0索引开始一个一个往后添加的，而是根据元素的哈希值跟数组的长度计算出应存入的位置
     *      int index = (数组长度 - 1) & 哈希值;
     *  3. 判断该位置是否为null，如果是null直接存入
     *  4. 如果该位置不为null，表示已经有元素了，则调用equals方法比较属性值
     *  5. 属性值一样，则不存入；如果属性值不一样，则存入，形成链表
     *      JDK8以前：新元素存入数组，老元素挂在新元素的下面，形成链表
     *      JDK8以后：新元素直接挂在老元素的下面，形成链表
     *
     * 加载因子：用于数组的扩容，当数组存了16x0.75=12个元素的时候，数组就会扩容为原先的两倍，即32的长度
     * JDK8以后，当链表长度大于8而且数组长度大于等于64时，链表会自动转换为红黑树，提高了查找效率
     * 如果集合中存储的是Student、Teacher等这种自定义对象，必须要重写hashCode方法和equals方法
     * 如果集合中存储的是String、Integer，就不需要我们自己去重写hashCode方法和equals方法，因为java已经重写好了
     */

    /**
     * HashSet的三个问题：
     *  1. HashSet为什么存和取的顺序不一样？
     *  2. HashSet为什么没有索引？
     *  3. HashSet是利用什么机制保证数据去重的？
     */
}
