package com.collection.demo04;

public class B {
    /**
     * 数据结构：
     *  是计算机底层存储、组织数据的方式，是指数据互相之间是以什么方式排列在一起的
     *  数据结构是为了更加方便的管理和使用数据，需要结合具体的业务场景来进行选择
     *  一般情况下，精心选择的数据结构可以带来更高的运行效率或者存储效率
     *
     * 只需要知道：
     *  1. 每种数据结构长什么样子？
     *  2. 如何添加数据？
     *  3. 如何删除数据？
     *
     * 常见的数据结构：
     *  1. 栈
     *  2. 队列
     *  3. 数组
     *  4. 链表
     *  5. 二叉树
     *  6. 二叉查找树
     *  7. 平衡二叉树
     *  8. 红黑树
     */

    /**
     * 栈
     * 栈的特点：后进先出，先进后出
     *  数据进入栈模型的过程称为：压/进栈
     *  数据离开栈模型的过程称为：弹/出栈
     */

    /**
     * 队列
     * 队列的特点：先进先出，后进后出
     *  数据从后端进入队列模型的过程称为：入队列
     *  数据从前端离开队列模型的过程称为：出队列
     */

    /**
     * 数组
     * 数组是一种查询快、增删慢的模型
     *  查询速度快：查询数据通过地址值和索引定位，查询任意数据耗时相同(元素在内存中是连续存储的)
     *  删除效率低：要将原始数据删除，同时后面每个数据前移
     *  添加效率极低：添加位置后的每个数据后移，再添加元素
     */

    /**
     * 链表
     *  链表里面的每一个元素，我们称之为结点
     *  每一个结点都是一个独立的对象，那么自身就会有一个地址值，表示结点在内存中的位置
     *  结点里面会存储以下信息：存储具体的数据、下一个结点的地址值
     *
     * 创建一个链表：
     *  第一个被创建出来的结点，我们称之为head结点
     *  假设添加一个数据A，首先创建一个新结点，新结点的地址假设11，结点里面：存储数据A、下一个结点地址为空
     *  新结点要与head结点建立联系：head结点的下一个结点地址值改为新结点的地址值11，这样head结点就与新结点链式连接起来了
     *  后面再添加一个数据C、数据D也是同理
     * 在数据AC之间添加一个数据B：
     *  创建一个新的结点，假设这个结点的地址值是54，结点里面：存储数据B、下一个结点地址为空
     *  数据B对应的下一个结点地址值指向数据C，这样数据B就与数据C链式连接起来了
     *  数据A对应的下一个结点地址值指向数据B，这样数据A就与数据B链式连接起来了
     * 删除数据BD之间的数据C：
     *  数据B对应的下一个结点地址值指向数据D
     *  直接删除数据C
     *
     * 链表中的结点是独立的对象，在内存中是不连续的，每个结点包含要存储的真实的数据值和下一个结点的地址值
     *
     * 链表是一种增删快的模型(相对于数组而言)
     *  链表查询慢：无论查询哪个数据都要从头开始找
     *  链表增删相对快
     *
     * 以上说的都是单向链表，也有一个双向链表
     *  双向链表的特点：每个结点除了存储数据、下一个结点的地址值之外，还有一个上一个结点的地址值
     *  双向链表可以提高查询的效率：比如要查询第N个元素，会先判断离头近还是离尾近，然后从近的一端开始查询
     */
}
