package com.hxb.demo29;

public class Test {
    static void main() {
        /**
         * 静态内部类：
         *  静态内部类只能访问外部类中的静态变量和静态方法
         *  如果在静态内部类中，想要访问外部类非静态的内容，需要创建外部类的对象
         * 创建静态内部类的对象：
         *  外部类名.内部类名 对象名 = new 外部类名.内部类名();
         * 调用静态内部类中非静态方法的格式：
         *  先创建对象，用对象调用
         * 调用静态内部类中静态方法的格式：
         *  外部类名.内部类名.方法名();
         */

        // 创建静态内部类的对象
        // 只要是静态的东西，都可以用类名点直接获取
        Outer.Inner oi = new Outer.Inner(); // Outer.Inner表示类型
        // 调用静态内部类中非静态方法
        oi.show1();

        // 调用静态内部类中静态方法
        Outer.Inner.show2();
    }
}
