package com.collection.demo08;

public class A {
    /**
     * 红黑树(数据结构)：
     *  红黑树是一种自平衡的二叉查找树，是计算机科学中用到的一种数据结构
     *  1972年出现，当时被称之为平衡二叉B树，后来，1978年被修改为如今的“红黑树”
     *  它是一种特殊的二叉查找树，红黑树的每一个节点上都有存储位表示节点的颜色
     *  每一个节点可以是红色或者黑色；红黑树不是高度平衡的，它的平衡是通过“红黑规则”进行实现的
     *  1. 红黑树是一个二叉查找树
     *  2. 红黑树不是高度平衡的
     *  3. 需要满足特有的红黑规则
     *
     * 红黑规则：
     *  1. 每一个节点或是红色的，或者是黑色的
     *  2. 根节点必须是黑色
     *  3. 如果一个节点没有子节点或者父节点，则该节点相应的指针属性值为Nil，这些Nil视为叶节点，每个叶节点(Nil)是黑色的
     *  4. 如果某一个节点是红色的，那么它的子节点必须是黑色的(不能出现两个红色节点相连的情况)
     *  5. 对每一个节点而言，从该节点到其所有后代叶节点的简单路径上，均包含相同数目的黑色节点
     *  红黑树中每一个节点的组成：数据、父节点的地址值、左子节点的地址值、右子节点的地址值、颜色(用于记录红黑树节点的颜色)
     *
     * 添加节点的规则：
     *  默认颜色：添加节点默认是红色的(效率高)
     *  根：直接变为黑色
     *  非根：
     *      父黑色：则不需要任何操作
     *      父红色：
     *          1. 叔叔红色：
     *              将“父”设为黑色，将“叔叔”设为黑色
     *              将“祖父”设为红色
     *              如果“祖父”为根，再将根变回黑色
     *              如果“祖父”非根，将“祖父”设置为当前节点再进行其他判断
     *          2. 叔叔黑色：当前节点是父的右孩子
     *              把“父”作为当前节点并左旋，再进行判断
     *          3. 叔叔黑色：当前节点是父的左孩子
     *              将“父”设为黑色
     *              将“祖父”变为红色
     *              以祖父为支点进行右旋
     *
     * 红黑树增删改查的性能都很好
     */
}
