package com.collection.demo08;

public class Test {
    /**
     * ArrayList：Array(数组) + List(属于List系列的一员)
     * LinkedList：Linked(链表) + List(属于List系列的一员)
     * HashSet：Hash(哈希表) + Set(属于Set系列的一员)
     * TreeSet：Tree(树) + Set(属于Set系列的一员)
     * LinkedHashSet：Linked(链表) + HashSet(父类)
     */

    /**
     * 树
     * 分为：
     *          父节点
     *    左子节点    右子节点
     *
     * 每一个节点都是一个独立的对象：里面包含数据、父节点的地址值、左子节点的地址值、右子节点的地址值
     * 如果没有父节点或者子节点，那么地址值为null
     *
     * 二叉树：任意节点的度<=2
     *  度：每一个节点的子节点数量
     *  树高：树的总层数
     *  根节点：最顶层的节点
     *  左子节点：左下方的节点
     *  右子节点：右下方的节点
     *  根节点的左子树：根节点的左子节点组成的树
     *  根节点的右子树：根节点的右子节点组成的树
     *
     * 二叉查找树：又称二叉排序树或者二叉搜索树
     *  特点：
     *      1. 每一个节点上最多有两个子节点
     *      2. 任意节点左子树上的值都小于当前节点
     *      3. 任意节点右子树上的值都大于当前节点
     *  添加节点的规则：
     *      1. 小的存左边
     *      2. 大的存右边
     *      3. 一样的不存
     *  查找节点的规则：
     *      1. 从根节点开始比较
     *      2. 如果要查找的值小于当前节点的值，那么去左子树继续比较
     *      3. 如果要查找的值大于当前节点的值，那么去右子树继续比较
     *      4. 如果要查找的值等于当前节点的值，那么返回当前节点
     *  遍历方式：(所有的二叉树都可以用这四种方式进行遍历)
     *      1. 前序遍历：从根节点开始，然后按照当前节点，左子节点，右子节点的顺序遍历
     *      2. 中序遍历：从最左边的子节点开始，然后按照左子节点，当前节点，右子节点的顺序遍历
     *      3. 后序遍历：从最左边的子节点开始，然后按照左子节点，右子节点，当前节点的顺序遍历
     *      4. 层序遍历：从根节点开始一层一层的遍历
     *  弊端：可能会出现链表结构，容易导致长短腿的出现，影响查找效率，
     *
     * 平衡二叉树：任意节点左右子树高度差不超过1
     * 平衡二叉树的旋转机制：
     *  1. 左旋
     *  2. 右旋
     *  3. 触发时机：当添加一个节点之后，该树不再是一棵平衡二叉树，即破坏了平衡就会触发旋转机制
     * 左旋：
     *  确定支点：从添加的节点开始，不断的往父节点找不平衡的节点
     *  步骤：
     *      1. 以不平衡的点作为支点
     *      2. 把支点左旋降级，变成左子节点
     *      3. 晋升原来的右子节点
     *  另一种情况：
     *      1. 以不平衡的点作为支点
     *      2. 将根节点的右侧往左拉
     *      3. 原先的右子节点变成新的父节点，并把多余的左子节点出让，给已经降级的根节点当右子节点
     * 右旋：
     *  确定支点：从添加的节点开始，不断的往父节点找不平衡的节点
     *  步骤：
     *      1. 以不平衡的点作为支点
     *      2. 把支点右旋降级，变成右子节点
     *      3. 晋升原来的左子节点
     *  另一种情况：
     *      1. 以不平衡的点作为支点
     *      2. 将根节点的左侧往右拉
     *      3. 原先的左子节点变成新的父节点，并把多余的右子节点出让，给已经降级的根节点当左子节点
     * 需要旋转的四种情况：
     *  1. 左左(一次右旋)：当根节点左子树的左子树有节点插入，导致二叉树不平衡
     *  3. 左右(先局部左旋，再整体右旋)：当根节点左子树的右子树有节点插入，导致二叉树不平衡
     *  2. 右右(一次左旋)：当根节点右子树的右子树有节点插入，导致二叉树不平衡
     *  4. 右左(先局部右旋，再整体左旋)：当根节点右子树的左子树有节点插入，导致二叉树不平衡
     */
}
