package com.hxb.variable;

public class VariableDemo03 {
    public static void main(String[] args) {
        /*
        计算机的存储规则（数字）
            1.在计算机中，任意数据都是以二进制的形式来存储的
            2.在计算机中，不同类型的数据有不同的存储单元

        计算机的存储单元
            1.一个0或者一个1表示一个bit（比特位）
            2.8个bit组成一个字节（byte），字节是计算机中最小的存储单元
                比如在记事本中，输入一个数字1，当右键属性查看发现占用1个字节
                1024字节 = 1KB（千字节）
                1024KB = 1MB（兆字节）
                1024MB = 1GB（吉字节）
                1024GB = 1TB（太字节）
                ...
            3.int类型的变量占用4个字节，32个bit

        整数类型
            1.byte（占用1个字节，8个bit）（取值范围：-128~127）
            2.short（占用2个字节，16个bit）（取值范围：-32768~32767）
            3.int（默认类型）（占用4个字节，32个bit）（取值范围：-2147483648~2147483647）
            4.long（占用8个字节，64个bit）（取值范围：-9223372036854775808~9223372036854775807）

        浮点数类型
            1.float（占用4个字节，32个bit）（取值范围：-3.4028234663852886E-38~3.4028234663852886E38）
            2.double（默认类型）（占用8个字节，64个bit）（取值范围：-1.7976931348623157E-304~1.7976931348623157E308）

        字符类型
            1.char（占用2个字节，16个bit）（取值范围：\u0000~\uffff）

        布尔类型
            1.boolean（占用1个字节，1个bit）（取值范围：true/false）
         */
    }
}
