package com.hxb.operator;

public class Demo19 {
    /**
     * java的运行机制：
     *  操作系统，比如windows、macOS等，其实是不认识java语言的，只认识0和1，因此需要编译，
     *  运行时，java文件会先编译成class文件（字节码文件），然后再运行class文件，
     *  但是class文件并不是真正运行在操作系统上的，而是运行在java虚拟机（JVM）上，
     *  因此可以实现跨平台运行，因此一套java代码可以在不同的操作系统上运行
     *
     * 内存：软件在运行时，用来临时存储数据的区域，当保存时，会将数据中的内容写入到硬盘中永久存储
     * 内存地址：给内存中的数据分配的唯一标识符，用来定位内存中的数据位置
     * 内存地址的规则：
     *  32位操作系统的内存地址是以32位的二进制表示的，地址的范围是0到4294967295，最大支持内存为4GB
     *  64位操作系统的内存地址是以64位的二进制表示的，最大支持内存为17179TB，一般以16进制表示
     *
     * java中的内存分配：java虚拟机会占用操作系统中的内存，用来存储java程序运行时的数据和指令，分为5个部分
     *  1. *栈内存：每个线程都有自己独立的栈，目前只要考虑一个即可，方法被调用进栈执行，执行完毕出栈
     *  2. *堆内存：所有线程共享，存储对象、数组、字符串常量池（如果使用到new关键字，就一定用到了堆内存）
     *  3. *方法区：jdk7永久代实现，jdk8+元空间实现，从虚拟机内部移到本地内存。存储字节码信息（与class文件相关）、常量、静态变量
     *  4. 本地方法栈：调用本地Native方法
     *  5. 程序计数器：每个线程独立、记录当前线程执行的字节码指令地址（行号）
     *
     * 基本数据类型：变量里面记录的是真实的数据，传递的也是真实的数据
     * 引用数据类型：变量里面记录的是引用地址，传递的是引用地址
     */
}
